--1 SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ДАТА FROM Н_ЛЮДИ INNER JOIN Н_ВЕДОМОСТИ ON (Н_ВЕДОМОСТИ.ИД=1457443 OR Н_ВЕДОМОСТИ.ИД=1250972) WHERE Н_ЛЮДИ.ИМЯ='Николай';
--2 SELECT Н_ЛЮДИ.ИМЯ, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.ГРУППА FROM Н_ЛЮДИ, Н_УЧЕНИКИ LEFT JOIN Н_ОБУЧЕНИЯ ON (Н_ОБУЧЕНИЯ.НЗК = '933232') WHERE Н_ЛЮДИ.ФАМИЛИЯ>'Ёлкин';
--3 SELECT COUNT(amount) FROM (SELECT "Н_ДИСЦИПЛИНЫ".НАИМЕНОВАНИЕ FROM "Н_ДИСЦИПЛИНЫ" UNION SELECT "Н_ДИСЦИПЛИНЫ".НАИМЕНОВАНИЕ FROM "Н_ДИСЦИПЛИНЫ") AS amount;

--5? SELECT AVG(EXTRACT(YEAR FROM "ДАТА_РОЖДЕНИЯ")), "Н_УЧЕНИКИ"."ГРУППА"
--         FROM "Н_ЛЮДИ"
--         INNER JOIN "Н_УЧЕНИКИ"
--         ON "ЧЛВК_ИД"="Н_ЛЮДИ"."ИД" GROUP BY "Н_УЧЕНИКИ"."ГРУППА";
-- SELECT EXTRACT(YEAR FROM "ДАТА_РОЖДЕНИЯ") , "Н_УЧЕНИКИ"."ГРУППА"
--         FROM "Н_ЛЮДИ"
--         INNER JOIN "Н_УЧЕНИКИ"
--         ON "ЧЛВК_ИД"="Н_ЛЮДИ"."ИД";
-- SELECT AVG(EXTRACT(YEAR FROM "ДАТА_РОЖДЕНИЯ")) AS N FROM "Н_ЛЮДИ" WHERE "ИД" IN (SELECT "Н_ЛЮДИ"."ИД" FROM "Н_ЛЮДИ" WHERE "ИД" IN(SELECT "Н_УЧЕНИКИ"."ЧЛВК_ИД" FROM "Н_УЧЕНИКИ" WHERE "ГРУППА"='1101'));

-- SELECT DISTINCT "Н_ЛЮДИ"."ОТЧЕСТВО", COUNT() FROM "Н_ЛЮДИ"
--
-- WHERE COUN
-- GROUP BY "ОТЧЕСТВО";

-- SELECT count()
-- FROM "Н_УЧЕНИКИ"
-- WHERE
SELECT "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" FROM "Н_ВЕДОМОСТИ" WHERE "ОЦЕНКА" NOT IN ('незач','2');
SELECT "Н_ЛЮДИ"."ИД" FROM "Н_ЛЮДИ" JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "ЧЛВК_ИД" WHERE "ОЦЕНКА" NOT IN ('незач','2');
SELECT "Н_ЛЮДИ"."ИД", COUNT("Н_ЛЮДИ"."ИД")FROM "Н_ЛЮДИ" JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "ЧЛВК_ИД" WHERE "ОЦЕНКА" NOT IN ('незач','2')
group by "Н_ЛЮДИ"."ИД";